; domain
(define (domain hanoi)
  (:requirements :strips :action-costs :equality)
  (:types disc peg - object)
  (:predicates
    (clear ?x - object)
    (on ?x - disc ?y - object)
    (smaller ?x - object ?y - disc)
    (base-peg ?x - object ?y - peg)
  )
  (:functions
    (total-cost)
    (move-cost ?peg-src ?peg-dst - peg)
  )

  (:action move
    :parameters (?disc - disc ?from - object ?base-from - peg ?to - object ?base-to - peg)
    :precondition (and (not (= ?base-from ?base-to)) (smaller ?to ?disc) (on ?disc ?from)
               (clear ?disc) (clear ?to) (base-peg ?disc ?base-from) (base-peg ?to ?base-to))
    :effect  (and
      (clear ?from)
      (on ?disc ?to)
      (base-peg ?disc ?base-to)
      (not (on ?disc ?from))
      (not (clear ?to))
      (not (base-peg ?disc ?base-from))
      (increase (total-cost) (move-cost ?base-from ?base-to))
  ))

)

; problem
(define (problem hanoi0)
  (:domain hanoi)
  (:objects peg1 peg2 peg3 peg4 - peg d1 d2 d3 - disc)
  (:init
   (smaller peg1 d1) (smaller peg1 d2) (smaller peg1 d3)
   (smaller peg2 d1) (smaller peg2 d2) (smaller peg2 d3)
   (smaller peg3 d1) (smaller peg3 d2) (smaller peg3 d3)
   (smaller peg4 d1) (smaller peg4 d2) (smaller peg4 d3)
   (smaller d2 d1) (smaller d3 d1) (smaller d3 d2)
   (clear peg2) (clear peg3) (clear peg4) (clear d1)
   (on d3 peg1) (on d2 d3) (on d1 d2)
   (base-peg peg1 peg1) (base-peg d1 peg1) (base-peg d2 peg1) (base-peg d3 peg1)
   (base-peg peg2 peg2)
   (base-peg peg3 peg3)
   (base-peg peg4 peg4)
   (= (total-cost) 0)

   (= (move-cost peg1 peg2) 1)
   (= (move-cost peg1 peg3) 1)
   (= (move-cost peg1 peg4) 2)

   (= (move-cost peg2 peg1) 1)
   (= (move-cost peg2 peg3) 1)
   (= (move-cost peg2 peg4) 2)

   (= (move-cost peg3 peg1) 1)
   (= (move-cost peg3 peg2) 1)
   (= (move-cost peg3 peg4) 2)

   (= (move-cost peg4 peg1) 2)
   (= (move-cost peg4 peg2) 2)
   (= (move-cost peg4 peg3) 2)
  )
  (:goal (and (on d3 peg3) (on d2 d3) (on d1 d2)))
  (:metric minimize (total-cost))
)

; plan
1. (move d1 d2 peg1 peg3 peg3)
   deleted: (on d1 d2) (clear peg3) (base-peg d1 peg1)
   added: (clear d2) (on d1 peg3) (base-peg d1 peg3)
   goals met: 1 of 3
2. (move d2 d3 peg1 peg2 peg2)
   deleted: (on d2 d3) (clear peg2) (base-peg d2 peg1)
   added: (clear d3) (on d2 peg2) (base-peg d2 peg2)
   goals met: 0 of 3
3. (move d1 peg3 peg3 d2 peg2)
   deleted: (on d1 peg3) (clear d2) (base-peg d1 peg3)
   added: (clear peg3) (on d1 d2) (base-peg d1 peg2)
   goals met: 1 of 3
4. (move d3 peg1 peg1 peg3 peg3)
   deleted: (on d3 peg1) (clear peg3) (base-peg d3 peg1)
   added: (clear peg1) (on d3 peg3) (base-peg d3 peg3)
   goals met: 2 of 3
5. (move d1 d2 peg2 peg1 peg1)
   deleted: (on d1 d2) (clear peg1) (base-peg d1 peg2)
   added: (clear d2) (on d1 peg1) (base-peg d1 peg1)
   goals met: 1 of 3
6. (move d2 peg2 peg2 d3 peg3)
   deleted: (on d2 peg2) (clear d3) (base-peg d2 peg2)
   added: (clear peg2) (on d2 d3) (base-peg d2 peg3)
   goals met: 2 of 3
7. (move d1 peg1 peg1 d2 peg3)
   deleted: (on d1 peg1) (clear d2) (base-peg d1 peg1)
   added: (clear peg1) (on d1 d2) (base-peg d1 peg3)
   goals met: 3 of 3
